{
    "common": {
        "name": "eufy-security",
        "version": "0.6.2",
        "news": {
            "0.6.2": {
                "en": "Updated version of the package eufy-security-client (1.1.2)",
                "de": "Version des Pakets eufy-security-client (1.1.2) aktualisiert",
                "ru": "Обновленная версия пакета eufy-security-client (1.1.2)",
                "pt": "Versão atualizada do pacote eufy-security-client (1.1.2)",
                "nl": "Bijgewerkte versie van het pakket eufy-security-client (1.1.2)",
                "fr": "Version mise à jour du paquet eufy-security-client (1.1.2)",
                "it": "Aggiornata la versione del pacchetto eufy-security-client (1.1.2)",
                "es": "Versión actualizada del paquete eufy-security-client (1.1.2)",
                "pl": "Zaktualizowana wersja pakietu eufy-security-client (1.1.2)",
                "zh-cn": "包 eufy-security-client (1.1.2) 的更新版本"
            },
            "0.6.1": {
                "en": "Fixed issue in the function responsible for the version upgrade",
                "de": "Problem in der für das Versions-Upgrade zuständigen Funktion behoben",
                "ru": "Исправлена проблема в функции, отвечающей за обновление версии",
                "pt": "Corrigido problema na função responsável pela atualização de versão",
                "nl": "Probleem opgelost in de functie die verantwoordelijk is voor de versie-upgrade",
                "fr": "Correction d'un problème dans la fonction responsable de la mise à niveau de version",
                "it": "Risolto problema nella funzione responsabile dell'aggiornamento della versione",
                "es": "Problema solucionado en la función responsable de la actualización de la versión",
                "pl": "Naprawiono błąd w funkcji odpowiedzialnej za aktualizację wersji",
                "zh-cn": "修复负责版本升级的函数中的问题"
            },
            "0.6.0": {
                "en": "Breaking changes - Refactoring to use new driver class with many new features and bugfixing",
                "de": "Breaking Changes - Refactoring zur Verwendung einer neuen Treiberklasse mit vielen neuen Funktionen und Fehlerbehebungen",
                "ru": "Критические изменения - рефакторинг для использования нового класса драйвера с множеством новых функций и исправлением ошибок.",
                "pt": "Quebrando mudanças - Refatoração para usar uma nova classe de driver com muitos novos recursos e correção de bugs",
                "nl": "Baanbrekende veranderingen - Refactoring om nieuwe driverklasse te gebruiken met veel nieuwe functies en bugfixing",
                "fr": "Changements de rupture - Refactoring pour utiliser une nouvelle classe de pilotes avec de nombreuses nouvelles fonctionnalités et corrections de bugs",
                "it": "Modifiche importanti - Refactoring per utilizzare una nuova classe di driver con molte nuove funzionalità e correzione di bug",
                "es": "Cambios importantes: refactorización para usar una nueva clase de controlador con muchas características nuevas y corrección de errores",
                "pl": "Przełomowe zmiany - Refaktoryzacja w celu użycia nowej klasy sterownika z wieloma nowymi funkcjami i poprawkami błędów",
                "zh-cn": "重大更改 - 重构以使用具有许多新功能和错误修复的新驱动程序类"
            },
            "0.5.5": {
                "en": "Fixed regression in p2p protocol",
                "de": "Regression im P2P-Protokoll behoben",
                "ru": "Исправлена регрессия в протоколе p2p",
                "pt": "Regressão fixa no protocolo p2p",
                "nl": "Vaste regressie in p2p-protocol",
                "fr": "Correction de la régression dans le protocole p2p",
                "it": "Risolto il problema con la regressione nel protocollo p2p",
                "es": "Regresión fija en el protocolo p2p",
                "pl": "Naprawiono regresję w protokole p2p",
                "zh-cn": "在p2p协议中修复了回归"
            },
            "0.5.4": {
                "en": "Fixed issue with video corruption in p2p livestream",
                "de": "Problem mit Videobeschädigung im P2P-Livestream behoben",
                "ru": "Исправлена проблема с повреждением видео в прямом эфире p2p.",
                "pt": "Corrigido problema de corrupção de vídeo na transmissão ao vivo P2P",
                "nl": "Probleem opgelost met videocorruptie in p2p-livestream",
                "fr": "Correction d'un problème de corruption vidéo dans le livestream p2p",
                "it": "Risolto il problema con la corruzione del video nel livestream p2p",
                "es": "Se solucionó el problema con la corrupción de video en la transmisión en vivo p2p",
                "pl": "Naprawiono problem z uszkodzeniem wideo w transmisji na żywo p2p",
                "zh-cn": "修复了P2P直播中视频损坏的问题"
            },
            "0.5.3": {
                "en": "Fixed issue #121 and #130",
                "de": "Problem Nr. 121 und Nr. 130 behoben",
                "ru": "Исправлена проблема № 121 и № 130.",
                "pt": "Correção do problema nº 121 e nº 130",
                "nl": "Probleem # 121 en # 130 opgelost",
                "fr": "Problèmes résolus # 121 et # 130",
                "it": "Risolto il problema # 121 e # 130",
                "es": "Problema solucionado # 121 y # 130",
                "pl": "Naprawiono problem # 121 i # 130",
                "zh-cn": "修复了＃121和＃130问题"
            },
            "0.5.2": {
                "en": "Try to add support for FreeBSD",
                "de": "Versuchen Sie, Unterstützung für FreeBSD hinzuzufügen",
                "ru": "Попробуйте добавить поддержку FreeBSD",
                "pt": "Tente adicionar suporte para FreeBSD",
                "nl": "Probeer ondersteuning voor FreeBSD toe te voegen",
                "fr": "Essayez d'ajouter le support pour FreeBSD",
                "it": "Prova ad aggiungere il supporto per FreeBSD",
                "es": "Intente agregar soporte para FreeBSD",
                "pl": "Spróbuj dodać obsługę FreeBSD",
                "zh-cn": "尝试添加对FreeBSD的支持"
            },
            "0.5.1": {
                "en": "Fixed issue #105",
                "de": "Problem Nr. 105 behoben",
                "ru": "Исправленная проблема # 105",
                "pt": "Problema nº 105 corrigido",
                "nl": "Probleem # 105 opgelost",
                "fr": "Problème résolu n ° 105",
                "it": "Risolto il problema # 105",
                "es": "Problema solucionado # 105",
                "pl": "Naprawiono problem nr 105",
                "zh-cn": "已修复问题105"
            },
            "0.5.0": {
                "en": "Added support for smart lock products and some improvements",
                "de": "Unterstützung für Smart Lock-Produkte und einige Verbesserungen hinzugefügt",
                "ru": "Добавлена поддержка продуктов Smart Lock и некоторые улучшения.",
                "pt": "Adicionado suporte para produtos de bloqueio inteligente e algumas melhorias",
                "nl": "Ondersteuning toegevoegd voor slimme vergrendelingsproducten en enkele verbeteringen",
                "fr": "Ajout de la prise en charge des produits de verrouillage intelligent et de certaines améliorations",
                "it": "Aggiunto supporto per i prodotti smart lock e alcuni miglioramenti",
                "es": "Se agregó soporte para productos de bloqueo inteligente y algunas mejoras.",
                "pl": "Dodano obsługę produktów Smart Lock i kilka ulepszeń",
                "zh-cn": "增加了对智能锁产品的支持和一些改进"
            },
            "0.4.3": {
                "en": "Code enhancements for publishing the adapter to the central repository",
                "de": "Codeverbesserungen zum Veröffentlichen des Adapters im zentralen Repository",
                "ru": "Улучшения кода для публикации адаптера в центральном репозитории",
                "pt": "Aprimoramentos de código para publicar o adaptador no repositório central",
                "nl": "Codeverbeteringen voor het publiceren van de adapter naar de centrale opslagplaats",
                "fr": "Améliorations du code pour la publication de l'adaptateur dans le référentiel central",
                "it": "Miglioramenti al codice per la pubblicazione dell'adattatore nel repository centrale",
                "es": "Mejoras de código para publicar el adaptador en el repositorio central",
                "pl": "Udoskonalenia kodu dotyczące publikowania adaptera w centralnym repozytorium",
                "zh-cn": "用于将适配器发布到中央存储库的代码增强"
            },
            "0.4.2": {
                "en": "Corrected state roles based on ioBroker documentation",
                "de": "Korrigierte Statusrollen basierend auf der ioBroker-Dokumentation",
                "ru": "Исправлены государственные роли на основе документации ioBroker.",
                "pt": "Funções de estado corrigidas com base na documentação do ioBroker",
                "nl": "Statusrollen gecorrigeerd op basis van ioBroker-documentatie",
                "fr": "Rôles d'état corrigés sur la base de la documentation ioBroker",
                "it": "Ruoli di stato corretti in base alla documentazione di ioBroker",
                "es": "Roles estatales corregidos según la documentación de ioBroker",
                "pl": "Poprawione role stanu na podstawie dokumentacji ioBroker",
                "zh-cn": "根据ioBroker文档更正了状态角色"
            },
            "0.4.1": {
                "en": "Removed legacy password encryption support for admin adapter",
                "de": "Unterstützung für ältere Kennwortverschlüsselung für Admin-Adapter entfernt",
                "ru": "Удалена поддержка устаревшего шифрования паролей для адаптера администратора.",
                "pt": "Suporte de criptografia de senha legado removido para adaptador admin",
                "nl": "Ondersteuning voor oude wachtwoordversleuteling voor admin-adapter verwijderd",
                "fr": "Suppression de la prise en charge du chiffrement des mots de passe hérités pour l'adaptateur admin",
                "it": "Rimosso il supporto per la crittografia delle password legacy per l'adattatore admin",
                "es": "Se eliminó el soporte de cifrado de contraseña heredado para el adaptador admin",
                "pl": "Usunięto obsługę wcześniejszego szyfrowania haseł dla adaptera admin",
                "zh-cn": "删除了对管理员适配器的旧密码加密支持"
            },
            "0.4.0": {
                "en": "Added new p2p features and applied some bugfixing",
                "de": "Neue P2P-Funktionen hinzugefügt und Bugfixes angewendet",
                "ru": "Добавлены новые функции p2p и исправлены некоторые ошибки.",
                "pt": "Adicionados novos recursos p2p e corrigidos alguns bugs",
                "nl": "Nieuwe p2p-functies toegevoegd en enkele bugfixes toegepast",
                "fr": "Ajout de nouvelles fonctionnalités p2p et correction de bogues",
                "it": "Aggiunte nuove funzionalità p2p e applicate alcune correzioni di bug",
                "es": "Se agregaron nuevas funciones p2p y se aplicaron algunas correcciones de errores",
                "pl": "Dodano nowe funkcje p2p i poprawiono kilka błędów",
                "zh-cn": "添加了新的p2p功能并应用了一些错误修复"
            },
            "0.3.1": {
                "en": "Fixed regression on livestream with h265 codec",
                "de": "Regression im Livestream mit h265-Codec behoben",
                "ru": "Исправлена регрессия в прямом эфире с кодеком h265",
                "pt": "Regressão corrigida na transmissão ao vivo com codec h265",
                "nl": "Vaste regressie op livestream met h265-codec",
                "fr": "Correction de la régression sur la diffusion en direct avec le codec h265",
                "it": "Risolto il problema con la regressione in live streaming con il codec h265",
                "es": "Se corrigió la regresión en la transmisión en vivo con el códec h265",
                "pl": "Naprawiono regresję podczas transmisji na żywo z kodekiem h265",
                "zh-cn": "使用H265编解码器修复了实时流的回归"
            },
            "0.3.0": {
                "en": "Implemented feature request #81, #88 and asynchronous download of event videos including some fixes",
                "de": "Implementierte Feature-Anforderung Nr. 81, Nr. 88 und asynchrones Herunterladen von Ereignisvideos einschließlich einiger Korrekturen",
                "ru": "Реализован запрос функции # 81, # 88 и асинхронная загрузка видео событий, включая некоторые исправления.",
                "pt": "Solicitação de recurso implementada nº 81, nº 88 e download assíncrono de vídeos de eventos, incluindo algumas correções",
                "nl": "Functieverzoek # 81, # 88 geïmplementeerd en asynchrone download van evenementvideo's inclusief enkele fixes",
                "fr": "Implémentation de la demande de fonctionnalité n ° 81, n ° 88 et du téléchargement asynchrone des vidéos d'événements, y compris des correctifs",
                "it": "Richiesta di funzionalità implementata n. 81, n. 88 e download asincrono di video di eventi, comprese alcune correzioni",
                "es": "Solicitud de función implementada # 81, # 88 y descarga asincrónica de videos de eventos, incluidas algunas correcciones",
                "pl": "Zaimplementowano żądanie funkcji # 81, # 88 i asynchroniczne pobieranie filmów z wydarzeń, w tym kilka poprawek",
                "zh-cn": "已实现功能请求＃81，＃88和事件视频的异步下载，包括一些修复程序"
            },
            "0.2.5": {
                "en": "Fixed possible race condition that brokes sometime the livestream",
                "de": "Möglicher Rennzustand behoben, der irgendwann den Livestream bricht",
                "ru": "Исправлено возможное состояние гонки, которое иногда прерывает прямую трансляцию",
                "pt": "Corrigida possível condição de corrida que interrompe em algum momento da transmissão ao vivo",
                "nl": "Mogelijke raceconditie opgelost die de livestream soms verbrak",
                "fr": "Correction d'une condition de course possible qui cassait parfois le livestream",
                "it": "Risolta la possibile condizione di gara che a volte interrompeva il live streaming",
                "es": "Se corrigió una posible condición de carrera que interrumpía en algún momento la transmisión en vivo.",
                "pl": "Naprawiono możliwy stan wyścigu, który czasami przerywał transmisję na żywo",
                "zh-cn": "修复了可能导致直播中断的比赛条件"
            },
            "0.2.4": {
                "en": "Fixed issue #86",
                "de": "Problem Nr. 86 behoben",
                "ru": "Исправленная проблема # 86",
                "pt": "Problema nº 86 corrigido",
                "nl": "Probleem # 86 opgelost",
                "fr": "Problème résolu n ° 86",
                "it": "Risolto il problema # 86",
                "es": "Problema solucionado # 86",
                "pl": "Naprawiono problem nr 86",
                "zh-cn": "已修复问题86"
            },
            "0.2.3": {
                "en": "Fixed wired doorbell p2p livestream and push notifications",
                "de": "Feste kabelgebundene Türklingel p2p Livestream- und Push-Benachrichtigungen behoben",
                "ru": "Фиксированный проводной дверной звонок p2p livestream и push-уведомления",
                "pt": "Correção da transmissão ao vivo P2P da campainha com fio e notificações push",
                "nl": "Vaste bedrade deurbel p2p livestream en pushmeldingen",
                "fr": "Sonnette filaire fixe p2p livestream et notifications push",
                "it": "Risolto il problema con il livestream p2p del campanello cablato e le notifiche push",
                "es": "Timbre fijo con cable p2p transmisión en vivo y notificaciones push",
                "pl": "Naprawiono transmisję na żywo i powiadomienia push z dzwonka do drzwi przewodowego",
                "zh-cn": "固定有线门铃p2p直播和推送通知"
            },
            "0.2.2": {
                "en": "Fixed web extension settings for serving videos and pictures",
                "de": "Die Einstellungen für die Web-Erweiterung zum Bereitstellen von Videos und Bildern wurden korrigiert",
                "ru": "Исправлены настройки веб-расширения для обслуживания видео и изображений",
                "pt": "Configurações de extensão da web corrigidas para veicular vídeos e fotos",
                "nl": "Vaste instellingen voor webextensies voor het weergeven van video's en afbeeldingen",
                "fr": "Correction des paramètres d'extension Web pour la diffusion de vidéos et d'images",
                "it": "Risolte le impostazioni dell'estensione web per la pubblicazione di video e immagini",
                "es": "Configuración de extensión web fija para servir videos e imágenes",
                "pl": "Naprawiono ustawienia rozszerzeń internetowych dotyczące udostępniania filmów i zdjęć",
                "zh-cn": "修复了用于投放视频和图片的Web扩展程序设置"
            }
        },
        "title": "Eufy Security",
        "titleLang": {
            "en": "Eufy Security",
            "de": "Eufy Sicherheit",
            "ru": "Eufy Security",
            "pt": "Segurança Eufy",
            "nl": "Eufy-beveiliging",
            "fr": "Sécurité Eufy",
            "it": "Eufy Security",
            "es": "Seguridad Eufy",
            "pl": "Eufy Security",
            "zh-cn": "Eufy安全"
        },
        "desc": {
            "en": "Support for Eufy-Security cameras with stations",
            "de": "Unterstützung für Eufy-Security-Kameras mit Stationen",
            "ru": "Поддержка камер Eufy-Security со станциями",
            "pt": "Suporte para câmeras de segurança Eufy com estações",
            "nl": "Ondersteuning voor Eufy-Security-camera's met stations",
            "fr": "Prise en charge des caméras Eufy-Security avec stations",
            "it": "Supporto per telecamere Eufy-Security con stazioni",
            "es": "Soporte para cámaras Eufy-Security con estaciones",
            "pl": "Wsparcie dla kamer Eufy-Security ze stacjami",
            "zh-cn": "支持带站的Eufy-Security摄像机"
        },
        "authors": [
            "bropat <patrick.broetto@gmail.com>"
        ],
        "keywords": [
            "eufy",
            "eufycam",
            "cam",
            "cameras",
            "security",
            "doorbell",
            "eufy-security",
            "iobroker"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "build/main.js",
        "icon": "eufy-security.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/bropat/ioBroker.eufy-security/master/admin/eufy-security.png",
        "readme": "https://github.com/bropat/ioBroker.eufy-security/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "alarm",
        "compact": true,
        "connectionType": "cloud",
        "dataSource": "poll",
        "materialize": true,
        "webExtension": "build/lib/web.js",
        "dependencies": [
            {
                "js-controller": ">=3.1.4",
                "web": ">=2.0.0"
            }
        ],
        "globalDependencies": [
            {
                "admin": ">=4.0.9"
            }
        ],
        "dataFolder": "eufy-security.%INSTANCE%",
        "jsonConfig": true,
        "adminUI": {
            "config": "json"
        }
    },
    "encryptedNative": [
        "password"
    ],
    "protectedNative": [
        "password"
    ],
    "native": {
        "username": "",
        "password": "",
        "pollingInterval": 10,
        "maxLivestreamDuration": 120,
        "verificationMethod": 2,
        "eventDuration": 15,
        "webInstance": "*",
        "p2pConnectionType": "prefer_local",
        "acceptInvitations": true,
        "alarmSoundDuration": 60
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "",
            "type": "meta",
            "common": {
              "name": "User files for eufy-security",
              "type": "meta.user"
            },
            "native": {}
        }
    ]
}